Kaggle Titanic Datasetinde Jose Portilla eğitimi çalışmaları

In [16]:
!git status #bunu ilk açtığında çalıştıracaksın bir sefer

On branch main
Your branch is up to date with 'origin/main'.

Changes not staged for commit:
  (use "git add <file>..." to update what will be committed)
  (use "git restore <file>..." to discard changes in working directory)
	modified:   GitHubKomutlar.ipynb
	modified:   TitanicDataAnalysisWork.ipynb

no changes added to commit (use "git add" and/or "git commit -a")

In [30]:
#bunu ilk açtığında çalıştıracaksın bir sefer

In [17]:
!git pull

Already up to date.

In [28]:
#değişiklik yaptıkça önce 1. olarak bu komut

In [31]:
!git add .

In [32]:
 #değişiklik yaptıkça önce 2. olarak bu komut

In [33]:
!git commit -m "GitHubCommit"

[main e808dc1] GitHubCommit
 Committer: Ferhat HanÃ§er (DoguÅŸ Hospitality Ferhat.hancer Retail) <ferhat.hancer@dogushrg.com>
Your name and email address were configured automatically based
on your username and hostname. Please check that they are accurate.
You can suppress this message by setting them explicitly:

    git config --global user.name "Your Name"
    git config --global user.email you@example.com

After doing this, you may fix the identity used for this commit with:

    git commit --amend --reset-author

 1 file changed, 210 insertions(+), 39 deletions(-)

In [34]:
#değişiklik yaptıkça önce 3. olarak bu komut

In [35]:
!git push

To https://github.com/hferhat/DataWorks.git
   33e4958..e808dc1  main -> main

In [13]:
import pandas as pd
from pandas import Series,DataFrame

In [14]:
titanic_df = pd.read_csv("train.csv")

In [15]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB